/// 电梯类型
const equipmentTypeJsonData = ['曳引与强制驱动电梯', '自动扶梯与自动人行道', '液压电梯', '消防员电梯', '杂物电梯', '防爆电梯'];

/// 电梯品牌
const equipmentBrandJsonData = [
  '通力',
  '三菱',
  '日立',
  '奥的斯',
  '迅达',
  '蒂升',
  '巨人通力',
  '杭州西奥',
  '奥的斯机电',
  '东芝',
  '富士达',
  '西继迅达',
  '沃克斯',
  '西子',
  '康力',
  '广日',
  '永大',
  '现代',
  '爱登堡',
  '斯迈普',
  '怡达快速',
  '其他'
];

/// 故障部件(直梯)
const failurePartForElevator = [
  {
    '不适用': [
      {
        '不适用': ['不适用'],
      }
    ],
  },
  {
    '曳引系统': [
      {
        '曳引机': [
          '抱闸',
          '曳引轮',
          '导向轮',
          '盘车装置',
          '松闸扳手',
          '马达风扇',
          '编码器或测速发电机',
          '旋转变压器',
          '机房反绳轮',
          '主机轴承',
        ],
        '曳引钢丝绳': ['曳引绳', '绳头组件'],
      },
    ],
  },
  {
    '导向装置': [
      {
        '导轨导靴': [
          '轿厢导轨',
          '对重导轨',
          '导轨支架',
          '轿厢滑动导靴',
          '轿厢滚动导靴',
          '对重滑动导靴',
          '对重滚动导靴',
          '油杯（导轨润滑装置）',
        ],
      },
    ],
  },
  {
    '轿厢': [
      {
        '轿架': [
          '称重机械装置',
          '平衡铁',
          '轿厢减震垫',
        ],
        '轿厢': [
          '轿厢照明或天花板',
          '通风装置',
          '光幕或安全触板',
          '地板',
          '轿厢护脚板',
          '无障碍装置（扶手等）',
          '轿壁',
          '轿厢装潢',
        ],
        '轿厢内控制装置': [
          '内呼按钮',
          '轿内显示屏及附属',
          '功能锁开关',
          '轿内急停、检修开关',
          '刷卡器',
          '轿厢电路板',
        ],
      },
    ],
  },
  {
    '轿顶': [
      {
        '轿顶电器机械装置': [
          '电路板',
          '变压器',
          '检修盒',
          '称重电气装置',
          '插座',
          '轿顶照明设施',
          '轿厢编码器',
          '轿厢机械锁及开关',
          '护栏装置及开关',
          '上、下行阻止装置及开关',
          '语音报站ACU',
        ],
      },
    ],
  },
  {
    '门系统': [
      {
        '厅门轿门': [
          '门扇',
          '地坎',
          '偏心轮',
          '门楣或门立柱',
          '门脚滑块',
          '门挂轮或导轨',
          '门挂板',
          '门锁钩',
          '厅门轿门触点',
          '防扒门开启装置',
          '门刀装置（门刀弹簧，门刀限位器，收刀撞板）',
          '厅门轿门同步装置',
          '层门护脚板',
          '地坎或地坎支架',
          '门球',
          '自闭装置',
          '厅外开锁装置（三角钥匙锁）',
        ],
        '门机装置': [
          '门机板',
          '门机插件及其接线',
          '门机板保险丝',
          '关门到位传感器或磁铁',
          '门机变压器',
          '门机马达',
          '门机传动装置',
        ],
      },
    ],
  },
  {
    '对重及补偿装置': [
      {
        '对重装置': [
          '对重框',
          '对重块',
          '对重反绳轮',
          '对重块固定板',
        ],
        '补偿装置': [
          '补偿轮',
          '补偿链或绳',
          '补偿装置及支架',
          '补偿装置电气开关',
        ],
      },
    ],
  },
  {
    '电气及控制装置': [
      {
        '线路及插件': ['电气线路及插件'],
        '驱动柜': [
          '变频器',
          '抱闸控制器',
          '保险丝',
          '接触器',
          '驱动电路板',
          '变压器',
          '制动电阻',
          '风扇',
        ],
        '控制柜': ['控制柜电路板', '保险丝', '主控板CPU', '相序开关', '门旁路开关', '变压器', '接触器', '急停开关', '检修开关'],
        '平层装置': ['平层感应器', '平层感应片或带或支架', '平层磁铁'],
        '厅门外控制装置': ['外呼装置', '厅外显示', '钥匙开关', '电路板', '刷卡器'],
        '井道及底坑电气': ['急停开关', '底坑照明设施', '插座', '电路板及其接线', '井道照明设施', '随行电缆', '爬梯装置及开关'],
      },
    ],
  },
  {
    '应急装置': [
      {
        '应急照明': [
          '应急电池',
          '应急照明',
        ],
        '应急五方通话': ['对讲适配器', '通话线路', '隔离模块', '对讲电源', '轿顶话机', '轿厢话机', '机房话机', '底坑话机', '监控室话机'],
      },
    ],
  },
  {
    '安全部件': [
      {
        '限速器及涨紧装置': [
          '限速器开关',
          '限速器绳',
          '限速器轮或轴承',
          '限速器编码器',
          '涨紧轮或轴承',
          '涨紧配重（重锤）',
          '涨紧轮开关',
        ],
        '补偿装置': ['补偿绳挡绳装置开关', '补偿绳张紧装置联动杆弹簧（调整）'],
        '安全钳': ['安全钳机械装置', '安全钳开关'],
        '减速和极限开关': ['减速磁条', '减速感应器', '减速开关支架', '极限开关', '极限撞弓'],
        '缓冲器': ['缓冲器装置', '缓冲器开关'],
        '安全门、检修门': ['门扇门框装置', '开关触点'],
      },
    ],
  },
  {
    '其他附件装置': [
      {
        '消防开关': [
          '消防开关',
          '接触器',
        ],
        '地震检测': ['地震仪', '电路板', '接触器'],
        '闸机装置': ['闸门', '电路板', '旋转控制装置'],
        '电动松闸': ['电路板', '电池'],
        '物联网装置': ['物联网模块', '语音转接板', '物联网电源模块', '蓄电池', '天线', '串口线', 'SIM卡'],
        '紧急电池驱动功能': ['电池', '接触器', '电路板'],
        '通风装置': ['空调或风扇或风幕机'],
      },
    ],
  },
];

/// 故障部件(扶梯)
const failurePartForEscalator = [
  {
    '不适用': [
      {
        '不适用': ['不适用'],
      }
    ],
  },
  {
    '驱动部件': [
      {
        '抱闸': [
          '抱闸电磁铁',
          '制动衬、制动臂',
          '抱闸弹簧',
          '附加制动器电磁铁',
          '附加制动器棘爪',
          '附加制动器制动盘',
          '制动器抬起监控',
        ],
        '马达、齿轮箱': ['马达', '马达上端盖、下端盖、端盖轴承', '齿轮箱', '联轴器', '飞轮及飞轮盖', '马达-齿轮箱表面喷涂', '马达、齿轮箱紧固螺栓'],
        '驱动传动部件': ['主驱动链', '扶手带驱动链', '链条罩', '扶手带二级驱动链', '扶手带三级驱动链', '主驱动皮带', '齿轮（主驱动齿轮，扶手带驱动齿轮，齿轮箱输出轴齿轮）', '主轴-扶手带轴-回转轴轴承', '主轴，扶手带轴，回转轴，支架'],
        '梯级及梯级链': ['缓冲垫', '梯级、梯级钩或人行道踏板', '梯级紧固件', '梯级黄边', '梯级轮', '梯级链轮', '梯级链驱动轮', '梯级白块', '梯级链'],
        '梯级轨道系统': [
          '梯级下陷装置',
          '梯级抬升装置',
          '下部拉伸导轨',
          '防偏轨',
          '静电刷',
          '模组及导轨',
          '模组及导轨表面喷涂',
          '延长轨/切向导轨',
          '卸载导轨',
          '上下端回转导轨',
          '梯级导轨',
          '链条导轨',
          '导轨链接件',
          '反轨',
          '多功能支撑板'
        ],
      },
    ],
  },
  {
    '裙板-盖板-楼层板': [
      {
        '楼层板-梳齿板': [
          '梳齿',
          '梳齿板（梳齿板安全开关动作或相关问题时选择）',
          '楼层板',
          '边框',
          '楼层板检测开关',
          '梳齿板触杆（梳齿板保护触发连杆）',
          '扶梯标识牌LOGO',
          '楼层板支撑',
        ],
        '裙板': [
          '裙板',
          '裙板刷',
          '裙板开关',
          '裙板固定支架',
          '裙板照明',
        ],
        '盖板': [
          '盖板紧固',
          '中间盖板',
          '内盖板',
          '外盖板',
          '盖板嵌条',
        ],
      },
    ],
  },
  {
    '控制系统': [
      {
        '控制柜部件': [
          '印刷电路板（主板，选项板，安全扩充板）',
          '变频器',
          '接触器',
          '辅助接触器',
          '辅助抱闸控制器',
          '继电器',
          '相位监控',
          '风扇',
          '端子',
          '变压器',
          '主开关',
          '断路器、保险丝',
          '漏电保护器',
          '温控开关',
          '能量回收单元',
        ],
        '电气安装部件': [
          '灯（裙板灯、梳齿灯、梳齿照明灯、梯级间隙灯、扶手带灯、腹板灯）',
          '交通灯',
          '传感器（马达测速，梯级缺失，扶手带测速、驱动链、烟雾、地震监控传感器）',
          '扶手带测速装置',
          '雷达、雷达放大器',
          '故障显示器',
          '对射光幕， 红外线光幕',
          '安全开关（开关本身故障时选择）',
          '检修手柄',
          '钥匙开关',
          '制动电阻',
          '加热器',
          '蜂鸣器',
          '线缆',
          '线缆锁紧头',
          '水位检测开关',
        ],
      },
    ],
  },
  {
    '扶手及护栏系统': [
      {
        '扶手带导轨系统': [
          '龙头回转链',
          '上、下弯弧扶手带导轨型材',
          '龙头扶手带导轨型材',
          '直线段扶手带导轨型材',
          '扶手带导轨接头',
          '扶手带压紧轮支架及导向支架',
          '龙头回转轮',
        ],
        '扶手带及面板': [
          '扶手带入口毛刷  入口开关',
          '入口面板',
          '扶手带',
        ],
        '扶手带导轮系统': [
          '扶手带吊带轮',
          '扶手带涨紧轮',
          '扶手带静电轮',
          '扶手带拖轮',
          '扶手带上下水平段导向轮',
        ],
        '护栏系统': [
          '玻璃护栏',
          '三明治护栏',
          '不锈钢斜护栏',
          '玻璃夹板',
          '不锈钢护栏卡扣',
        ],
        '扶手带驱动': [
          '扶手带驱动轮',
          '扶手带压紧轮',
        ],
        '端部驱动': [
          '龙头驱动轮',
          '扶手带龙头驱动双排齿轮',
          '龙头驱动二级驱动链涨紧装置',
          '龙头驱动轮、双排齿轮、涨紧轮轴承',
        ],
      },
    ],
  },
  {
    '其他附件装置': [
      {
        '加油装置': ['润滑装置润滑油管路', '加油装置毛刷', '加油装置油泵及油壶'],
        '物联网装置': [
          '远程监控主控盒',
          '传感器控制盒',
          '震动传感器',
          '齿轮箱温度传感器',
          '扶手带温度传感器',
          '电流互感器',
          '底坑震动传感器',
        ],
        '附件装置': [
          '铭牌',
          '防爬板',
          '安全标识',
          '梯路锁',
          '喷淋',
        ],
      },
    ],
  },
  {
    '桁架及侧封板': [
      {
        '桁架': [
          '桁架',
          '桁架连接螺栓',
          '桁架喷涂',
          '桁架端部固定',
          '中间支撑',
        ],
        '侧封板': [
          '侧封板',
          '底腹板',
          '侧封板角钢',
        ],
      },
    ],
  },
];

/// 故障原因(扶梯)
const failureReasonForEscalator = [
  {
    '其它': ['未发现故障', '不适用'],
  },
  {
    '设备原因': ['技术故障', '部件磨损', '部件失效'],
  },
  {
    '外部原因': ['大楼电源故障', '人为损坏', '进水或者天气影响', '扶手带开关动作', '裙摆开关动作', '梳齿板开关动作', '安装装置动作'],
  },
  {
    '误报': ['误报'],
  },
  {
    '客户额外服务': ['甲方要求设备停用', '合同外的值班或保驾', '配合甲方'],
  },
];

/// 故障原因(直梯)
const failureReasonForElevator = [
  {
    '其它': ['未发现故障', '不适用'],
  },
  {
    '设备原因': ['技术故障', '部件磨损', '部件失效'],
  },
  {
    '外部原因': ['大楼电源故障', '人为损坏', '进水或者天气影响', '异物卡阻'],
  },
  {
    '误报': ['误报'],
  },
  {
    '客户额外服务': ['甲方要求设备停用', '合同外的值班或保驾', '配合甲方'],
  },
];

/// 现场设备状况(扶梯)
const currentDeviceStateForEscalator = [
  {
    '无法确认': ['未能进入工地', '其它'],
  },
  {
    '设备停运': ['可由钥匙复位', '不可由钥匙复位', '梯级损坏'],
  },
  {
    '设备可运行': ['振动', '噪音', '运行正常', '非关键部位损坏', '按钮失效'],
  },
];

/// 现场设备状况(直梯)
const currentDeviceStateForElevator = [
  {
    '无法确认': ['未能进入工地', '其它'],
  },
  {
    '设备停运': ['冲顶', '蹲底', '平层，门开', '平层，门关', '层间', '层间，厅门关', '层间，厅门开'],
  },
  {
    '设备可运行': ['不平层', '振动', '噪音', '按钮失效', '运行正常'],
  },
];
